{
  "facts": [
    "The average person spends 31 hours in meetings every month.",
    "Studies show that 71% of meetings are considered unproductive by employees.",
    "Taking notes by hand improves memory retention by 34%.",
    "The human brain can only focus for about 20 minutes without a break.",
    "Standing meetings are 34% shorter than sitting meetings.",
    "The best time for creative meetings is late morning, around 10-11 AM.",
    "Your brain continues processing information for hours after a conversation.",
    "Writing down your goals makes you 42% more likely to achieve them.",
    "The average attention span during a meeting is just 8 seconds.",
    "People remember only 10% of what they hear after 72 hours.",
    "Visual aids can improve learning by up to 400%.",
    "The most productive meetings have between 5-8 participants.",
    "90% of communication is non-verbal, including tone and body language.",
    "Your brain can process images 60,000 times faster than text.",
    "Multitasking can reduce productivity by up to 40%.",
    "The ideal meeting length is 30-45 minutes for maximum engagement.",
    "Humans speak at about 150 words per minute on average.",
    "Our brain forgets 50% of new information within an hour.",
    "Active listening can improve retention by up to 25%.",
    "The human voice can convey over 24 different emotions.",
    "Walking meetings can boost creative thinking by 60%.",
    "Your brain uses 20% of your body's energy during intense thinking.",
    "People make decisions faster when standing rather than sitting.",
    "The average person checks their phone 96 times per day.",
    "AI can now transcribe speech with 95% accuracy.",
    "Your brain creates new neural pathways every time you learn something.",
    "Silence in conversation helps people process complex information.",
    "The human brain can hold about 7 pieces of information at once.",
    "Regular breaks during work can improve productivity by 13%.",
    "Your brain is most alert 2-4 hours after waking up.",
    "People retain 65% more information when paired with relevant images.",
    "The average professional spends 28% of their workday reading emails.",
    "Your brain needs 90-120 minutes to complete a full focus cycle.",
    "Action items written down are 33% more likely to be completed.",
    "The human brain weighs about 3 pounds but uses 20% of body's oxygen.",
    "Speaking slowly can increase comprehension by up to 20%.",
    "Your brain processes positive feedback faster than negative.",
    "The best ideas often come during breaks, not during work.",
    "Humans can recognize a familiar voice in just 0.25 seconds.",
    "Your brain is 73% water - hydration affects cognitive performance.",
    "People are 50% more engaged when they contribute to discussions.",
    "The average person forgets 3 things per day.",
    "Your brain forms first impressions in just 7 seconds.",
    "Organized notes can improve recall by up to 40%.",
    "The human ear can distinguish over 400,000 different sounds.",
    "Your brain continues learning even while you sleep.",
    "People remember stories 22 times better than facts alone.",
    "The average person speaks about 16,000 words per day.",
    "Your brain can generate about 50,000 thoughts per day.",
    "Asking questions increases information retention by 50%."
  ]
}
